12/data/attachments/29bd75af9291256e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b8bdc268-8d1c-4fe1-af39-b8ece679cdb1</nif:username>
            <nif:friendToBeAdded>Rhonda_popular_Actions_44210_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>